In [1]:
import sqlalchemy

In [ ]:
sqlalchemy.create_engine('postgresql://username@localhost/parch')

In [4]:
%load_ext sql

In [5]:
%sql postgresql://username:password@localhost/parch

1. What is the average order value for each paper type?

In [49]:
%%sql
SELECT AVG(standard_qty) AS standard_average,
       AVG(poster_qty) AS poster_average,
       AVG(gloss_qty) AS gloss_average
FROM   orders

 * postgresql://dominic:***@localhost/parch
1 rows affected.

[(Decimal('280.4320023148148148'), Decimal('104.6941550925925926'), Decimal('146.6685474537037037'))]

2. How do the averages of the paper types vary across different regions?

In [50]:
%%sql
SELECT r.name,
       AVG(standard_qty) AS standard_average,
       AVG(poster_qty) AS poster_average,
       AVG(gloss_qty) AS gloss_average
FROM   orders AS o
JOIN   accounts AS a ON o.account_id=a.id
JOIN   sales_reps AS s ON a.sales_rep_id=s.id
JOIN   region AS r ON s.region_id=r.id
GROUP BY r.name

 * postgresql://dominic:***@localhost/parch
4 rows affected.

[('Midwest', Decimal('292.3467112597547380'), Decimal('92.9509476031215162'), Decimal('152.9966555183946488')),
 ('Southeast', Decimal('279.6729249011857708'), Decimal('95.2495059288537549'), Decimal('136.4436758893280632')),
 ('West', Decimal('283.4651162790697674'), Decimal('131.9804161566707466'), Decimal('152.1995104039167687')),
 ('Northeast', Decimal('274.4467543487484090'), Decimal('98.3572337717437420'), Decimal('149.2061943148069580'))]

* Across all regions, standard has the highest average followed by gloss and lastly poster
* let us check how the sales differ across these regions

3. which regions have the highest and lowest sales?

In [53]:
%%sql
SELECT r.name,
       SUM(total_amt_usd) AS total_amt
FROM   orders AS o
JOIN   accounts AS a ON o.account_id=a.id
JOIN   sales_reps AS s ON a.sales_rep_id=s.id
JOIN   region AS r ON s.region_id=r.id
GROUP BY r.name
ORDER BY total_amt DESC

 * postgresql://dominic:***@localhost/parch
4 rows affected.

[('Northeast', Decimal('7744405.36')),
 ('Southeast', Decimal('6458497.00')),
 ('West', Decimal('5925122.96')),
 ('Midwest', Decimal('3013486.51'))]

  4. Total sales and average sales per order of each sales rep

In [89]:
%%sql
SELECT
     s.name,
     SUM(total_amt_usd) AS total_sales
FROM
     orders AS o
    INNER JOIN accounts AS a ON o.account_id=a.id
    INNER JOIN sales_reps AS s ON a.sales_rep_id=s.id
    INNER JOIN region AS r ON s.region_id=r.id
GROUP BY
    s.name
ORDER BY
    total_sales DESC

 * postgresql://dominic:***@localhost/parch
50 rows affected.

[('Earlie Schleusner', Decimal('1098137.72')),
 ('Tia Amato', Decimal('1010690.60')),
 ('Vernita Plump', Decimal('934212.93')),
 ('Georgianna Chisholm', Decimal('886244.12')),
 ('Arica Stoltzfus', Decimal('810353.34')),
 ('Dorotha Seawell', Decimal('766935.04')),
 ('Nelle Meaux', Decimal('749076.16')),
 ('Sibyl Lauria', Decimal('722084.27')),
 ('Maren Musto', Decimal('702697.29')),
 ('Brandie Riva', Decimal('675917.64')),
 ('Charles Bidwell', Decimal('675637.19')),
 ('Elwood Shutt', Decimal('662500.24')),
 ('Maryanna Fiorentino', Decimal('655954.74')),
 ('Moon Torian', Decimal('650393.52')),
 ('Hilma Busick', Decimal('622808.04')),
 ('Dawna Agnew', Decimal('604519.38')),
 ('Calvin Ollison', Decimal('594516.08')),
 ('Cliff Meints', Decimal('556105.34')),
 ('Gianna Dossey', Decimal('550973.02')),
 ('Michel Averette', Decimal('523977.06')),
 ('Delilah Krum', Decimal('512179.11')),
 ('Elna Condello', Decimal('508913.05')),
 ('Micha Woodford', Decimal('488448.47')),
 ('Necole Victory', Decimal('475282.05')),
 ('Samuel Racine', Decimal('470408.98')),
 ('Cordell Rieder', Decimal('447934.80')),
 ('Julia Behrman', Decimal('447712.91')),
 ('Derrick Boggess', Decimal('383933.65')),
 ('Saran Ram', Decimal('362689.34')),
 ('Renetta Carew', Decimal('330188.69')),
 ('Shawanda Selke', Decimal('327828.61')),
 ('Eugena Esser', Decimal('311801.45')),
 ('Marquetta Laycock', Decimal('307940.94')),
 ('Debroah Wardle', Decimal('293374.01')),
 ('Ernestine Pickron', Decimal('283243.25')),
 ('Retha Sears', Decimal('283203.03')),
 ('Silvana Virden', Decimal('262170.64')),
 ('Lavera Oles', Decimal('258316.81')),
 ('Sherlene Wetherington', Decimal('218909.58')),
 ('Ayesha Monica', Decimal('217146.59')),
 ('Babette Soukup', Decimal('215905.27')),
 ('Carletta Kosinski', Decimal('213032.45')),
 ('Soraya Fulton', Decimal('210436.05')),
 ('Chau Rowles', Decimal('184282.60')),
 ('Cara Clarke', Decimal('166138.65')),
 ('Akilah Drinkard', Decimal('136613.99')),
 ('Kathleen Lalonde', Decimal('116307.79')),
 ('Elba Felder', Decimal('114976.59')),
 ('Julie Starr', Decimal('89097.65')),
 ('Nakesha Renn', Decimal('49361.11'))]

5. What is the median out of the total sums each of our sales reps are bringing in?

In [104]:
%%sql
WITH sales_data AS(
SELECT
s.name AS sales_rep_name,
SUM(o.total_amt_usd) AS total_sales
FROM 
    orders AS o
    INNER JOIN accounts AS a ON o.account_id=a.id
    INNER JOIN sales_reps AS s ON a.sales_rep_id=s.id
GROUP BY
    s.name
ORDER BY
    total_sales DESC
),
count_sales AS(
    SELECT COUNT(*) total_count FROM sales_data
)
SELECT
AVG(total_sales) AS median_sales
FROM
(
SELECT
total_sales,
ROW_NUMBER()OVER (ORDER BY total_sales)row_num,
total_count
FROM
sales_data
CROSS JOIN count_sales
)ranked_sales
WHERE
row_num IN (total_count/2,(total_count/2)+1)

 * postgresql://dominic:***@localhost/parch
1 rows affected.

[(Decimal('459171.890000000000'),)]

6. Which sales reps are perfoming above average?

In [125]:
%%sql
SELECT
     s.name,
     SUM(total_amt_usd) AS total_sales
FROM
     orders AS o
    INNER JOIN accounts AS a ON o.account_id=a.id
    INNER JOIN sales_reps AS s ON a.sales_rep_id=s.id
    INNER JOIN region AS r ON s.region_id=r.id
GROUP BY
    s.name
HAVING   SUM(total_amt_usd)>=459171.89
ORDER BY
    total_sales DESC

 * postgresql://dominic:***@localhost/parch
25 rows affected.

[('Earlie Schleusner', Decimal('1098137.72')),
 ('Tia Amato', Decimal('1010690.60')),
 ('Vernita Plump', Decimal('934212.93')),
 ('Georgianna Chisholm', Decimal('886244.12')),
 ('Arica Stoltzfus', Decimal('810353.34')),
 ('Dorotha Seawell', Decimal('766935.04')),
 ('Nelle Meaux', Decimal('749076.16')),
 ('Sibyl Lauria', Decimal('722084.27')),
 ('Maren Musto', Decimal('702697.29')),
 ('Brandie Riva', Decimal('675917.64')),
 ('Charles Bidwell', Decimal('675637.19')),
 ('Elwood Shutt', Decimal('662500.24')),
 ('Maryanna Fiorentino', Decimal('655954.74')),
 ('Moon Torian', Decimal('650393.52')),
 ('Hilma Busick', Decimal('622808.04')),
 ('Dawna Agnew', Decimal('604519.38')),
 ('Calvin Ollison', Decimal('594516.08')),
 ('Cliff Meints', Decimal('556105.34')),
 ('Gianna Dossey', Decimal('550973.02')),
 ('Michel Averette', Decimal('523977.06')),
 ('Delilah Krum', Decimal('512179.11')),
 ('Elna Condello', Decimal('508913.05')),
 ('Micha Woodford', Decimal('488448.47')),
 ('Necole Victory', Decimal('475282.05')),
 ('Samuel Racine', Decimal('470408.98'))]

7. which channels in web events generate the most leads?

In [128]:
%%sql
SELECT channel,
       COUNT(id) AS events
    FROM web_events
    GROUP BY channel
    ORDER BY events DESC

 * postgresql://dominic:***@localhost/parch
6 rows affected.

[('direct', 5298),
 ('facebook', 967),
 ('organic', 952),
 ('adwords', 906),
 ('banner', 476),
 ('twitter', 474)]